{
  "status": "success",
  "totalResults": 34,
  "results": [
    {
      "title": "EPL: He’s a generational talent – Gary Neville tells Southgate player that must start for England",
      "link": "https://dailypost.ng/2022/10/04/epl-hes-a-generational-talent-gary-neville-tells-southgate-player-that-must-start-for-england/",
      "keywords": [
        "Sport",
        "England",
        "EPL",
        "gary neville",
        "Southgate"
      ],
      "creator": [
        "Don Silas"
      ],
      "video_url": null,
      "description": "Manchester United legend, Gary Neville, has suggested there will be a ‘real problem’ if England manager, Gareth Southgate cannot find a place for Manchester City’s Phil Foden in the Three Lions’ starting XI at the 2022 FIFA World Cup. With the World Cup tournament now less than eight weeks, football pundits and fans alike are […] EPL: He’s a generational talent – Gary Neville tells Southgate player that must start for England",
      "content": "Daily Post Nigeria EPL: He’s a generational talent – Gary Neville tells Southgate player that must start for England Home News Peter Obi fumes over supporter’s alleged attack, arrest in Lagos Buhari to present N19.76trn 2023 budget to NASS on Friday Peter Obi will be in Anambra, Imo, Abia for campaign rally – Aisha Yesufu to Bwala Russia’s parliament approves annexation of Ukraine’s regions Biafra: IPOB members not terrorists, I live with them – Peter Obi Politics 2023 presidency: Yoruba should not be selfish – Adebutu 2023: Peter Obi’s running mate, Baba-Ahmed warns against underestimating LP candidate Osun guber: Court judgment against APC primary dead on arrival – Oyetola’s counsel 2023: Why Tinubu is always in the news – APC chieftain, Oyalowo Abia 2023: Ex-Reps member, Chinenye Ike, hundreds of supporters return to PDP Metro Flood sacks Kogi Assembly members from their quarters Police confirm mysterious deaths in Kogi Thousands stranded on Niger Bridge as flood takes over Kogi-Abuja road So-Safe arrests 12 illegal miners in Ogun Man stabs 40-year-old co-tenant to death in Ondo Entertainment Nigerian Oscars committee rejects Kunle Afolayan’s Anikulapo movie BBNaija: Nigerians react as Phyna emerges winner of reality show BBNaija: How Nigerians voted Phyna, Bryann, Bella, Adekunle, others Phyna emerges winner of BBNaija Season 7 BBNaija finale: Bella evicted from reality show Sport EPL: He’s a generational talent – Gary Neville tells Southgate player that must start for England EPL: I wouldn’t like to face Iwobi – Lampard Amusan set to be nominated for World Athletics Athlete of the Year award U-17 WWC: Flamingos captain, Dah-Zossu confident of good outing in India EPL: I like him a lot – Liverpool coach, Klopp on Arsenal star Sport EPL: He’s a generational talent – Gary Neville tells Southgate player that must start for England Published on October 4, 2022 By Don Silas Manchester United legend, Gary Neville, has suggested there will be a ‘real problem’ if England manager, Gareth Southgate cannot find a place for Manchester City’s Phil Foden in the Three Lions’ starting XI at the 2022 FIFA World Cup. With the World Cup tournament now less than eight weeks, football pundits and fans alike are debating what England’s starting team should be for their first game against Iran on November 21 and who should be in Southgate’s 26-man squad. One place up for debate seems to be in the right forward attacking position, with many uncertain between Foden and Arsenal’s Bukayo Saka for the starting spot in the England squad. But Neville believes Foden is a generational talent that should start for England at the World Cup. “I feel really strongly on the forward options,” Neville told Sky Sports. “I love a lot of those players but if we can’t find a starting position for Phil Foden in our national team I think that is a real problem. “He is a generational talent. He is on a different level in that sense. That feels more wrong to me than Trent Alexander-Arnold.” England are in Group B at the World Cup alongside Iran, USA and Wales. Related Topics: England EPL gary neville Southgate Don't Miss EPL: I wouldn’t like to face Iwobi – Lampard You may like EPL: I wouldn’t like to face Iwobi – Lampard EPL: I like him a lot – Liverpool coach, Klopp on Arsenal star EPL: Rio Ferdinand, Jamie Carragher involved in Twitter fight over comments on Ronaldo EPL: Carragher names top club that cannot win title this season EPL: William Saliba has exposed you – Jermaine Jenas tells Arsenal player EPL: Rio Ferdinand slams Arsenal for awarding Partey, names best Arsenal player in latest win Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd",
      "pubDate": "2022-10-04 11:31:49",
      "image_url": null,
      "source_id": "dailypost",
      "country": [
        "nigeria"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "Ukraine to join Spain and Portugal in bid to co-host 2030 FIFA World Cup",
      "link": "https://www.independent.ie/sport/soccer/world-cup/ukraine-to-join-spain-and-portugal-in-bid-to-co-host-2030-fifa-world-cup-42038493.html",
      "keywords": [
        "World Cup"
      ],
      "creator": null,
      "video_url": null,
      "description": "Ukraine is set to join Spain and Portugal in their bid to host the 2030 FIFA World Cup.",
      "content": "Ukraine is set to join Spain and Portugal in their bid to host the 2030 FIFA World Cup. U kraine would host one of the groups in the tournament under the plan which is understood to have been sanctioned by Ukraine's president Volodymyr Zelenskiy and the governments of Spain and Portugal, according to The Times. The new partnership is due to be announced by Spain and Portugal soccer chiefs during a news conference at European governing body UEFA's headquarters on Wednesday, the report added. Reuters has contacted the sport's world governing body FIFA, which organises the World Cup, and UEFA for comment. The 2022 World Cup will begin on Nov. 20 in Qatar, while the 2026 edition will be played in the US, Canada and Mexico. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up Read More Why Roy Keane is right about Cristiano Ronaldo and Manchester United Liverpool's Darwin dilemma: Why Jurgen Klopp was forced to 'radically change' plan for under-performing Nunez Richard Jolly: Opinion Is Liverpool’s malaise a blip or something bigger? ‘Pretty much everything’ is in need of improvement",
      "pubDate": "2022-10-04 09:57:56",
      "image_url": "https://www.independent.ie/sport/soccer/world-cup/40eb2/42038492.ece/AUTOCROP/w1240h700/67762536",
      "source_id": "independent",
      "country": [
        "ireland"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "Russian football official reacts to Ukraine World Cup plans",
      "link": "https://www.rt.com/sport/564018-russia-reaction-ukraine-world-cup-bid/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
      "keywords": null,
      "creator": [
        "RT"
      ],
      "video_url": null,
      "description": "Ukrainian plans to join a bid for the 2030 FIFA World Cup are unrealistic, according to Russian football official Vyacheslav Koloskov Read Full Article at RT.com",
      "content": "Ukraine’s plan to join Spain and Portugal in bidding to host the 2030 FIFA World Cup is a PR exercise and is unlikely to become a reality, according to Russian football official Vyacheslav Koloskov. The Times reported this week that Ukraine is set to become part of the Iberian joint bid for the tournament, where it could host part of the group stages. The news will be confirmed on Wednesday at UEFA headquarters, according to the British newspaper. Responding to the claims, honorary Russian Football Union (RFU) president Koloskov – who is a former FIFA vice-president – suggested the idea was fanciful. “This is the decision of the Ukrainian [football] federation, but of course it is absolutely unrealistic,” the veteran dignitary told RIA Novosti . “No one will allow the holding of the World Cup in countries so far from each other. I repeat, this is not very realistic. “This is done so that everyone understands that Ukraine is ready to host the tournament or part of the tournament at the level of the World Cup. “It’s hard to guess why, no one explains their motivation. “I personally see this as a PR campaign, it makes sense to promote themselves, what they think about the future of the country, the federation, football, and so on. “But I repeat that this is unlikely to happen.” Ukraine does have experience of organizing a major football tournament before, joining forces with Poland to host the 2012 UEFA European Championship. The 2030 World Cup bid, should it materialize, would take place in very different circumstances considering the ongoing conflict with Russia and the uncertainty it creates. Any three-way bid by Spain, Portugal and Ukraine would face competition from a South American campaign comprising Uruguay, Argentina, Chile and Paraguay, as well as a potential joint bid from Saudi Arabia, Egypt and Greece. The hosting rights for the 2030 World Cup are due to be announced by FIFA in 2024. The last edition of the World Cup was held in Russia in 2018, which was widely hailed as a major success. The next version will take place in Qatar in November and December of this year, with the 2026 edition being held in the USA, Canada and Mexico.",
      "pubDate": "2022-10-04 09:34:09",
      "image_url": "https://cdni.russiatoday.com/files/2022.10/thumbnail/633bfd2f85f5405ed67e9092.jpg",
      "source_id": "rt",
      "country": [
        "united kingdom"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "French cities announce Qatar World Cup snub",
      "link": "https://www.rt.com/sport/564014-french-cities-qatar-world-cup-boycott/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
      "keywords": null,
      "creator": [
        "RT"
      ],
      "video_url": null,
      "description": "Several French cities have declared that they will not set up fan zones for the 2022 FIFA World Cup as a protest against Qatar Read Full Article at RT.com",
      "content": "Several large cities will not have fan zones or show World Cup matches on giant screens A number of large French cities including the capital Paris will not broadcast matches from the 2022 FIFA World Cup on giant screens in public areas, as part of a protest against tournament host Qatar. Qatar will become the first ever Arab nation to welcome the football showpiece when it hosts the World Cup from November 20 to December 18. The build-up to the tournament has been overshadowed by criticism of Qatar’s human rights record. A report from The Guardian newspaper last year claimed that more than 6,500 migrant workers have died in the Gulf state since it was awarded World Cup hosting rights in 2010. Qatar has vehemently denied those figures but has implemented reforms to its labor system in an effort to improve conditions for migrants. Read more Football icon blasts ex-professionals for Qatar World Cup promotion The mayors of several French cities have now said that “ecological and humanitarian issues” mean that they should not create an atmosphere of celebration for fans who want to watch the tournament, where France will be the defending champion. “It would be a farce if we were to be complicit with the humanitarian and ecological abuses that are embodied by this World Cup,” said Bordeaux mayor Pierre Hurmic on Monday, as quoted by Reuters. “It would be really difficult to have a party while forgetting the dead bodies and the humanitarian situation in the aberration that is the World Cup in Qatar.” The official added that it would be “incongruous” to celebrate the World Cup taking place at air-conditioned stadiums in Qatar while citizens across France are confronted with an energy crisis.     The leftist mayors of French cities Lille, Strasbourg and Reims are among those to similarly snub the tournament, while the deputy mayor of Paris, Pierre Rabadan, told AFP that the capital would not be setting up public viewing areas. “For us, there was no question of setting up big screen areas for several reasons: the first is the conditions in which this World Cup has been organized, both in terms of the environment and the social aspect,” said Rabadan. “The second is the fact that it takes place in December.” READ MORE: Qatar set to soften rules for World Cup lawbreakers – Reuters Protests against Qatar will extend to the players on the pitch at the World Cup. The kit manufacturer for Denmark last week revealed that the team would be playing in “toned-down” versions of their jerseys as a sign of dissent. The captains of several European teams also plan to wear rainbow armbands in support of the LGBT movement, although it remains to be seen if FIFA will allow the gesture.  ",
      "pubDate": "2022-10-04 08:09:19",
      "image_url": "https://cdni.russiatoday.com/files/2022.10/thumbnail/633be950203027702b6e2989.jpg",
      "source_id": "rt",
      "country": [
        "united kingdom"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "Ukraine to Join Spain and Portugal in Bid to Host 2030 FIFA World Cup",
      "link": "https://www.news18.com/news/football/ukraine-to-join-spain-and-portugal-in-bid-to-host-2030-fifa-world-cup-6094285.html",
      "keywords": [
        "sports"
      ],
      "creator": null,
      "video_url": null,
      "description": "Ukraine to host one of the groups in 2030 soccer world cup under the plan which is understood to have been sanctioned by Ukraine's president Volodymyr Zelenskiy and the governments of Spain and Portugal",
      "content": null,
      "pubDate": "2022-10-04 04:08:38",
      "image_url": "https://images.news18.com/ibnlive/uploads/2022/10/ukraine-16648564633x2.jpg",
      "source_id": "news18",
      "country": [
        "india"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "Ukraine in joint bid with Spain and Portugal for 2030 FIFA World Cup",
      "link": "https://sportstar.thehindu.com/football/ukraine-in-joint-bid-for-2030-fifa-world-cup/article65969203.ece",
      "keywords": null,
      "creator": [
        "\n        Reuters  \n    "
      ],
      "video_url": null,
      "description": "President Zelensky has given permission for Ukraine to join Spain and Portugal in move to host tournament.",
      "content": "Ukraine is set to join Spain and Portugal in their bid to host the 2030 FIFA World Cup, The Times reported on Monday. Ukraine would host one of the groups in the tournament under the plan, which is understood to have been sanctioned by Ukraine's president Volodymyr Zelensky and the governments of Spain and Portugal, The Times said. The new partnership is due to be officially announced by Spain and Portugal football chiefs during a news conference at European governing body UEFA’s headquarters on Wednesday. Although security assurances would be needed, the expectation is that, by 2030, Russia’s invasion will have been over for some time and the rebuilding of the country will be fully under way, the report added. The 2022 World Cup will begin on November 20 in Qatar, while the 2026 edition will be played in the U.S., Canada and Mexico. Read more stories on Football.",
      "pubDate": "2022-10-04 03:31:32",
      "image_url": null,
      "source_id": "sportstar",
      "country": [
        "india"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "Spain Striker Gerard Moreno Doubtful for FIFA World Cup After Hamstring Injury",
      "link": "https://www.news18.com/news/football/spain-striker-gerard-moreno-doubtful-for-fifa-world-cup-after-hamstring-injury-6093973.html",
      "keywords": [
        "sports"
      ],
      "creator": null,
      "video_url": null,
      "description": "Gerard Moreno missed out on Spain's recent UEFA Nations League matches due to the injury, but now the problem has resurfaced which seems that he won't be able to make it to FIFA World Cup",
      "content": null,
      "pubDate": "2022-10-04 02:19:01",
      "image_url": "https://images.news18.com/ibnlive/uploads/2022/10/gerard-16648497213x2.jpg",
      "source_id": "news18",
      "country": [
        "india"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    },
    {
      "title": "Rashidi Yekini to be Conferred with Posthumous MON on Tuesday",
      "link": "https://www.thisdaylive.com/index.php/2022/10/04/rashidi-yekini-to-be-conferred-with-posthumous-mon-on-tuesday/",
      "keywords": [
        "Sport"
      ],
      "creator": [
        "editor"
      ],
      "video_url": null,
      "description": "Former Nigerian football icon, Rashidi Yekini, is amongst the 437 eminent citizens and foreigners to be conferred with national Honours next Tuesday in Abuja. Yekini who scored Nigeria’s first ever",
      "content": "Former Nigerian football icon, Rashidi Yekini, is amongst the 437 eminent citizens and foreigners to be conferred with national Honours next Tuesday in Abuja. Yekini who scored Nigeria’s first ever FIFA World Cup goal at USA ‘94 died 10 years ago in Ibadan in a controversial manner. He is to be conferred with a posthumous Member of the Order of the Niger (MON) national award by President Muhammadu Buhari at the ceremony scheduled to hold on October 11 at the State House in Abuja. Fondly called Ye-King by his adoring fans, Yekini was Nigeria’s all-time top scorer with 37 goals for the Super Eagles. He represented Nigeria in seven major tournaments including two World Cups. He was named African Footballer of the Year in 1993. Apart from top politicians and retired military officers, three entertainers were also listed amongst those to be honoured. They include, Burna Boy, Tuface Idibia and Teni.",
      "pubDate": "2022-10-03 23:48:15",
      "image_url": null,
      "source_id": "thisdaylive",
      "country": [
        "nigeria"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "title": "Women’s FIFA World Cup: Everything You Need to Know About Scoring Tickets",
      "link": "https://www.lifehacker.com.au/2022/10/womens-world-cup-fifa/",
      "keywords": [
        "Entertainment",
        "Life",
        "au",
        "events",
        "fifa",
        "football",
        "sport",
        "Women's World Cup"
      ],
      "creator": [
        "Stephanie Nuzzo"
      ],
      "video_url": null,
      "description": "Calling all football fans. The post Women’s FIFA World Cup: Everything You Need to Know About Scoring Tickets appeared first on Lifehacker Australia.",
      "content": "The countdown is on, people. There is officially less than a year to go until the FIFA Women’s World Cup lands in Australia and New Zealand in 2023. Are you excited? Because we bloody well are. And EA Sports seems to be, too – seeing as Matilda’s captain Sam Kerr has been featured on the cover of the FIFA 23 standard and ultimate editions. In any case, if you’re prepping for this huge sporting event to take over your life in 2023, here is everything you need to know about the next FIFA Women’s World Cup. In case you missed the mention above, it has been confirmed that Australia and New Zealand would host the 2023 Women’s World Cup. On July 20, nine cities across Australia and NZ celebrated one year until the football comp with events like cultural lighting at dawn in Hamilton/Kirikiriroa, New Zealand, the unveiling of a new Unity Pitch in Sydney/Gadigal, Australia and celebratory lights all over the cities. World Cup games will be played in Brisbane, Adelaide, Melbourne, Perth and Sydney in Australia and Dunedin, Auckland, Hamilton and Wellington, New Zealand. The Women’s World Cup is slated for July 20 and will run through to August 20, 2023 . The first match will kick off at Auckland’s Eden Park. There are 32 nations set to compete in the 2023 Women’s World Cup. Australia and New Zealand get an automatic entry as hosts. Other confirmed teams include: South Africa, Nigeria, Morocco, Zambia, Jamaica, Costa Rica, Canada, USA, Vietnam, Sweden, Spain, Philippines, Korea Republic, Japan, France, Denmark, Colombia, China PR, Brazil, Argentina, Norway, Germany, England, Netherlands and Italy. You can keep up with the news on qualifying teams here . If you’re keen to watch these matches in the flesh, you’re going to want to keep a close eye on ticket announcements. These things are going to move, folks. FIFA has announced that tickets for the FIFA Women’s World Cup will go on sale online from October 6, 2022, with tickets starting from $20 for adults and $10 for children. Watch this space for tickets. For now, you can register your interest in tickets, via the link we shared above. If you’re wondering where you can watch the event, Optus Sport will stream all 64 Women’s World Cup matches live. Better get that subscription ready – or find someone else who has. For those interested in knowing who the main competition for the Matildas is, here is a breakdown of the nations that have won the title most times. We’ll keep updating this piece with additional news as it becomes available, but until then, why not check out our write-up on the Men’s World Cup comp for 2022. This article has been updated since its original publish date.",
      "pubDate": "2022-10-03 23:23:26",
      "image_url": "https://www.lifehacker.com.au/wp-content/uploads/sites/4/2022/10/04/GettyImages-1243181470.jpg?quality=80=1280,720",
      "source_id": "lifehacker",
      "country": [
        "australia"
      ],
      "category": [
        "entertainment"
      ],
      "language": "english"
    },
    {
      "title": "Barcelona, PSG, and an MLS club make offers to Lionel Messi - report",
      "link": "https://www.barcablaugranes.com/2022/10/3/23385573/barcelona-psg-and-an-mls-club-make-offers-to-lionel-messi-report",
      "keywords": null,
      "creator": [
        "Luis Mazariegos"
      ],
      "video_url": null,
      "description": null,
      "content": "Paris Saint-Germain are really happy with Lionel Messi and are ready to extend his current deal, but FC Barcelona will move to attract their legend back to the Camp Nou. And there is a third party in this tug of war - an MLS club. According to transfer expert Fabrizio Romano , PSG’s manager Christophe Galtier and their director Luis Campos, are “in love” with the Argentine star. After a difficult first season adapting to life in Paris, which included injuries and bouts with COVID, Messi is back to his old self and making it happen for PSG. That’s why the French champions are already sounding out Messi’s entourage to keep him at PSG for one or two more seasons. But Barcelona’s president, Joan Laporta, is also said to be crazy about bringing Messi back into the fold after overseeing his departure. It’s understood Laporta wants to clear up misunderstandings between him and Messi’s camp and welcome him back to his true home, alongside a coach, Xavi, who is a personal friend of his and thinks he has the master formula to get the best of him alongside Robert Lewandowski. The MLS club was not named in the report, but in the past the rumored destination has been Inter Miami. Messi has spent time on holiday in Florida, and the team co-owned by David Beckham thinks they could convince him to spend his final years wowing crowds in the US, just as Beckham once did. But Messi’s reply to PSG, Barcelona, and the unnamed MLS club was the same: he’s not making a decision until at least the end of the FIFA World Cup. It’s no secret that Messi’s biggest desire is to win the World Cup with his beloved Argentina, and this year’s tournament in Qatar could be his final chance. But even beyond that, Messi is said to be 100% focused on the pitch right now. He wants to win the UEFA Champions league with PSG, and he does not want to talk about salaries or contracts until the season is over. Barcelona say they have the financial resources today that they did not have in the past, when they let him go for free to PSG. He would come back as a free agent as well, and the club is clear in believing they will be able to meet his salary demands if they convince him to come.",
      "pubDate": "2022-10-03 21:09:00",
      "image_url": null,
      "source_id": "barcablaugranes",
      "country": [
        "united states of america"
      ],
      "category": [
        "sports"
      ],
      "language": "english"
    }
  ],
  "nextPage": 1
}
